var returnReason = '不符合授信要求;老客户未结清|申请信息异常;新商盟网站无法登陆|不符合授信要求;自主注册新客户|不符合授信要求;老客户未结清|申请信息异常;新商盟网站无法登陆|不符合授信要求;自主注册新客户|不符合授信要求;老客户未结清|申请信息异常;新商盟网站无法登陆|不符合授信要求;自主注册新客户|不符合授信要求;老客户未结清|申请信息异常;新商盟网站无法登陆|不符合授信要求;自主注册新客户|不符合授信要求;老客户未结清|申请信息异常;新商盟网站无法登陆|不符合授信要求;自主注册新客户|不符合授信要求;老客户未结清|申请信息异常;新商盟网站无法登陆|不符合授信要求;自主注册新客户|不符合授信要求;老客户未结清|申请信息异常;新商盟网站无法登陆|不符合授信要求;自主注册新客户|不符合授信要求;老客户未结清|申请信息异常;新商盟网站无法登陆|不符合授信要求;自主注册新客户|不符合授信要求;老客户未结清|申请信息异常;新商盟网站无法登陆|不符合授信要求;自主注册新客户|不符合授信要求;老客户未结清|申请信息异常;新商盟网站无法登陆|不符合授信要求;自主注册新客户|不符合授信要求;老客户未结清|申请信息异常;新商盟网站无法登陆|不符合授信要求;自主注册新客户|不符合授信要求;老客户未结清|申请信息异常;新商盟网站无法登陆|不符合授信要求;自主注册新客户|不符合授信要求;老客户未结清|申请信息异常;新商盟网站无法登陆|不符合授信要求;自主注册新客户|不符合授信要求;老客户未结清|申请信息异常;新商盟网站无法登陆|不符合授信要求;自主注册新客户|不符合授信要求;老客户未结清|申请信息异常;新商盟网站无法登陆|不符合授信要求;自主注册新客户|不符合授信要求;老客户未结清|申请信息异常;新商盟网站无法登陆|不符合授信要求;自主注册新客户|不符合授信要求;老客户未结清|申请信息异常;新商盟网站无法登陆|不符合授信要求;自主注册新客户|不符合授信要求;老客户未结清|申请信息异常;新商盟网站无法登陆|不符合授信要求;自主注册新客户|不符合授信要求;老客户未结清|申请信息异常;新商盟网站无法登陆|不符合授信要求;自主注册新客户|不符合授信要求;老客户未结清|申请信息异常;新商盟网站无法登陆|不符合授信要求;自主注册新客户|不符合授信要求;老客户未结清|申请信息异常;新商盟网站无法登陆|不符合授信要求;自主注册新客户|不符合授信要求;老客户未结清|申请信息异常;新商盟网站无法登陆|不符合授信要求;自主注册新客户|不符合授信要求;老客户未结清|申请信息异常;新商盟网站无法登陆|不符合授信要求;自主注册新客户|不符合授信要求;老客户未结清|申请信息异常;新商盟网站无法登陆|不符合授信要求;自主注册新客户|不符合授信要求;老客户未结清|申请信息异常;新商盟网站无法登陆|不符合授信要求;自主注册新客户|不符合授信要求;老客户未结清|申请信息异常;新商盟网站无法登陆|不符合授信要求;自主注册新客户|不符合授信要求;老客户未结清|申请信息异常;新商盟网站无法登陆|不符合授信要求;自主注册新客户|不符合授信要求;老客户未结清|申请信息异常;新商盟网站无法登陆|不符合授信要求;自主注册新客户|不符合授信要求;老客户未结清|申请信息异常;新商盟网站无法登陆|不符合授信要求;自主注册新客户|不符合授信要求;老客户未结清|申请信息异常;新商盟网站无法登陆|不符合授信要求;自主注册新客户|不符合授信要求;老客户未结清|申请信息异常;新商盟网站无法登陆|不符合授信要求;自主注册新客户|不符合授信要求;老客户未结清|申请信息异常;新商盟网站无法登陆|不符合授信要求;自主注册新客户|不符合授信要求;老客户未结清|申请信息异常;新商盟网站无法登陆|不符合授信要求;自主注册新客户|不符合授信要求;老客户未结清|申请信息异常;新商盟网站无法登陆|不符合授信要求;自主注册新客户|不符合授信要求;老客户未结清|申请信息异常;新商盟网站无法登陆|不符合授信要求;自主注册新客户|不符合授信要求;老客户未结清|申请信息异常;新商盟网站无法登陆|不符合授信要求;自主注册新客户|不符合授信要求;老客户未结清|申请信息异常;新商盟网站无法登陆|不符合授信要求;自主注册新客户|不符合授信要求;老客户未结清|申请信息异常;新商盟网站无法登陆|不符合授信要求;自主注册新客户|不符合授信要求;老客户未结清|申请信息异常;新商盟网站无法登陆|不符合授信要求;自主注册新客户|不符合授信要求;老客户未结清|申请信息异常;新商盟网站无法登陆|不符合授信要求;自主注册新客户|不符合授信要求;老客户未结清|申请信息异常;新商盟网站无法登陆|不符合授信要求;自主注册新客户|不符合授信要求;老客户未结清|申请信息异常;新商盟网站无法登陆|不符合授信要求;自主注册新客户|不符合授信要求;老客户未结清|申请信息异常;新商盟网站无法登陆|不符合授信要求;自主注册新客户||其他原因'
let arr = returnReason.split('||')
let arr1 = arr[0] ? arr[0].split('|') : []
let arr2 = []
let arr3 = []
let arr4 = []
let arr5 = []
if (arr1.length) {
  for (let x in arr1) {
    arr2.push(arr1[x].split(';'))
  }
}

if (arr[1]) {
  arr2.push([arr[1]])
}

for (let x in arr2) {
  arr3.push(arr2[x][0])
}
arr4 = Array.from(new Set(arr3))
// console.log(arr4)
for (let x in arr4) {
  let arr6 = [arr4[x]]
  for (let y in arr2) {
    if (arr2[y][0] === arr6[0] && arr2[y][1]) {
      arr6.push(arr2[y][1])
    }
  }
  arr5.push(arr6)
  console.log(arr5)
}
